app/controllers/songs_controller.rb

  def create
    @song = Song.new(song_params)

    if song.save
---
INSERT INTO "songs" ("title", "artist", "time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Laugh Now Cry Later"], ["artist", "Drake ft. Lil Durk"], ["time", "4:22"], ["created_at", "2020-11-16 17:37:50.865691"], ["updated_at", "2020-11-16 17:37:50.865691"]]

  def update
    song = Song.find(params[:id])
    song.update(song_params)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "Laugh Now Cry later"], ["updated_at", "2020-11-16 19:49:19.662888"], ["id", 2]]

  def destroy
    song = Song.destroy(params[:id])
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]